Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་རྣམ་པར་འཇིག་པས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་སྣང་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་འགོད་པའི་ཆོས་ལྟོས།
en: The bodhisattva Destroyer of Aggregates then replied to the bodhisattva Samantāloka, “Noble son, look at the phenomena arrayed before you!

source: མིག་གི་བུ་གར་གཟུགས་ཀྱི་ཕུང་པོ་དང་། འདོད་ཆགས་དང་བྲལ་བ་འཕོས་པའང་མ་ཡིན།
en: The aggregate of form and freedom from attachment are not transferred to the aperture of the eye.

source: མིག་གི་བུ་གར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ཕུང་པོ་དང་། འདོད་ཆགས་དང་བྲལ་བ་འཕོས་པ་ཡང་མ་ཡིན།
en: The aggregates of feeling, perception, formation, and consciousness, along with freedom from attachment, are not transferred to the aperture of the eye either.

source: སྐྱེ་མཆེད་ནི་མི་རྟོག་རྣམ་པར་མི་རྟོག་ཅིང་ལྡང་བའང་མ་ཡིན།
en: The sense fields are nonconceptual, beyond thought, and nonarising.

source: ཕུང་པོ་ནི་ངག་གི་ལམ་དང་། དབྱངས་དང་། སྒྲ་དང་བརྗོད་པ་ལས་ཡང་དག་པར་ཤིན་ཏུ་འདས་པའོ། །
en: The aggregates completely transcend language and are beyond voice, sound, and expression.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: རིགས་ཀྱི་བུ་ཆོས་ཐམས་ཅད་ནི་སྐད་ཅིག་མ་སྟེ། དངོས་པོ་དང་བྲལ་བའོ། །
en: Because, noble son, all phenomena are momentary and insubstantial.

source: ཆོས་ཐམས་ཅད་ནི་དབྱངས་མེད་པའོ། །དབྱངས་དང་བྲལ་བའོ། །
en: All phenomena lack a voice and are free from a voice.

source: ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་ལམ་སྟེ་མཚན་མ་མེད་པའོ། །
en: All phenomena are like a path in the sky—they leave no trace.

source: ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་མེད་པའོ། །སྨོན་པ་མེད་པའོ། །
en: All phenomena are wordless and without purpose.

source: ཆོས་ཐམས་ཅད་ནི་སྐྱེ་བ་མེད་པའོ། །སྟོང་པའོ། །
en: All phenomena are unborn and empty.

source: ཆོས་ཐམས་ཅད་ནི་ཐོབ་པ་མེད་པའོ། །ཚིག་མེད་པའོ། །
en: All phenomena lack anything to be gained and are wordless.

source: ཆོས་ཐམས་ཅད་ནི་རྟོག་པ་དང་བྲལ་བའོ། །མི་ཁོམ་པའོ། །
en: All phenomena are free from concepts and without moments.

source: ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་དང་བྲལ་བའོ། །རྐྱེན་མེད་པའོ། །
en: All phenomena are free from attachment and unconditioned.

source: ཆོས་ཐམས་ཅད་ནི་སྦྱོར་བ་དང་བྲལ་བའོ། །དམིགས་པ་མེད་པའོ། །
en: All phenomena lack sense contact and are without observation.

source: ཆོས་ཐམས་ཅད་ནི་ལྟ་བ་དང་བྲལ་བའོ། །མཚན་ཉིད་དབེན་པའོ། །
en: All phenomena are free from views and devoid of characteristics.

source: ཆོས་ཐམས་ཅད་ནི་དམིགས་པ་དང་བྲལ་བའོ། །བདག་མེད་པའོ། །
en: All phenomena are free from a cognitive basis and lack a self.

source: ཆོས་ཐམས་ཅད་ནི་བདག་དང་བྲལ་བའོ། །བརྗོད་དུ་མེད་པའོ། །
en: All phenomena are devoid of self and inexpressible.

source: ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་དང་བྲལ་བའོ། །རབ་ཏུ་ཞི་བའོ། །
en: All phenomena are devoid of words and utterly quiescent.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཉིད་མི་ཐོབ་པའོ། །མི་སྣང་བ་ཐོབ་པའོ། །
en: All phenomena have no true nature and do not manifest.

source: ཆོས་ཐམས་ཅད་ནི་སྣང་བ་དང་བྲལ་བའོ། །ཤིན་ཏུ་ཡུལ་མེད་པའོ། །
en: All phenomena lack appearance and are utterly without object.

source: ཆོས་ཐམས་ཅད་ནི་ཡུལ་དང་བྲལ་བའོ། །ཤིན་ཏུ་རྩ་བ་མེད་པའོ། །
en: All phenomena are devoid of object and utterly rootless.

source: ཆོས་ཐམས་ཅད་ནི་དབང་པོ་མེད་པའོ། །ཤིན་ཏུ་རང་བཞིན་མེད་པའོ། །
en: All phenomena are without the sense faculties and utterly devoid of intrinsic nature.

source: ཆོས་ཐམས་ཅད་ནི་སྤྱོད་པ་རྣམ་པར་དག་པའོ། །གཉེན་པོ་མེད་པའོ། །
en: All phenomena are without activity and without antidote.

source: ཆོས་ཐམས་ཅད་ནི་སེམས་མེད་པའོ། །ཆགས་པ་དང་བྲལ་བའོ། །
en: All phenomena lack being and are devoid of attachment.

source: ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་འཕྲོས་པའོ། །ཕུན་སུམ་ཚོགས་པ་དང་བྲལ་བའོ། །
en: All phenomena are utterly extinct and without fulfillment.

source: ཆོས་ཐམས་ཅད་ནི་འཇུངས་པ་མེད་པའོ། །སྤྲོས་པ་དང་བྲལ་བའོ། །
en: All phenomena are without avarice and free from elaboration.

source: ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་བསམ་གཏན་དང་ལྡན་པའོ། །གཡོ་བ་དང་བྲལ་བའོ། །
en: All phenomena are endowed with concentration and free from movement.

source: ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་སྒྲིབ་པ་མེད་པའོ། །རྡུལ་དང་བྲལ་བའོ། །ཤིན་ཏུ་བྲལ་བའོ། །
en: All phenomena are completely unobscured, free of dust—utterly free of dust.

source: ཆོས་ཐམས་ཅད་ནི་ཉོན་མོངས་པ་དང་བྲལ་བའོ། །སྟོབས་ཆུང་བའོ། །
en: All phenomena are free from affliction and weakness.

source: ཆོས་ཐམས་ཅད་ནི་རྩོམ་པ་དང་བྲལ་བའོ། །དངོས་པོ་མེད་པའོ། །
en: All phenomena are without beginning and nonexistent.

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་དང་བྲལ་བའོ། །བྱེད་པ་མེད་པའོ། །
en: All phenomena lack substance and are devoid of an agent.

source: ཆོས་ཐམས་ཅད་ནི་ལས་མི་སྟོན་པའོ། །ཚོར་བ་མེད་པའོ། །
en: All phenomena do not exhibit activity and are devoid of feeling.

source: ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་ལྡན་པའོ། །ཐོས་པ་མེད་པའོ། །
en: All phenomena are endowed with space and are not heard.

source: ཆོས་ཐམས་ཅད་ནི་དབྱངས་དང་བྲལ་བའོ། །གཟུང་དུ་མེད་པའོ། །
en: All phenomena are devoid of sound and intangible.

source: ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་སྡུག་པའོ། །ཤེས་པ་མེད་པའོ།
en: All phenomena are dissatisfying by nature and insentient.

source: ཆོས་ཐམས་ཅད་ནི་ཚོར་བ་ཆགས་པ་མེད་པའོ། །སྨིག་རྒྱུ་ལྟ་བུའོ། །
en: All phenomena lack attachment to feelings and are like a mirage.

source: ཆོས་ཐམས་ཅད་ནི་འདུ་ཤེས་དང་བྲལ་བའོ། །བྲག་ཅ་ལྟ་བུའོ། །
en: All phenomena are free from perception and are like an echo.

source: ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་མེད་པའོ། །གཟུགས་བརྙན་ལྟ་བུའོ། །
en: All phenomena have no essential nature and are like a reflection.

source: ཆོས་ཐམས་ཅད་ནི་རབ་ཏུ་སྣང་བའི་འོད་རྣམ་པར་དག་པ་ཆུ་ཟླ་ལྟ་བུའོ། །
en: All phenomena are free from radiant light like the reflection of the moon in water.

source: ཆོས་ཐམས་ཅད་ནི་གཟུགས་བརྙན་དང་བྲལ་བའོ། །གཟུགས་བརྙན་ལ་བརྟེན་པའོ། །
en: All phenomena are free from reflected images and dependent upon reflected images.

source: ཆོས་ཐམས་ཅད་ནི་སྤྲིན་མི་དམིགས་པའོ། །ནམ་མཁའ་དང་མཉམ་པའོ། །ཆོས་ཐམས་ཅད་ནི་གཟུགས་བརྙན་ནོ། །བསྟན་དུ་མེད་པའོ། །དངོས་པོ་མེད་པའོ། །དངོས་པོ་དང་བྲལ་བའོ། །
en: All phenomena are not apprehended as clouds—they are the same as the sky.

source: མཚན་ཉིད་མེད་པ་ནས། མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་དང་བྲལ་བ་དང་། མཉམ་པའི་མཚན་ཉིད་དང་། མཚན་ཉིད་གཅིག་པ་དང་།
en: All phenomena are reflections, invisible, nonexistent, and insubstantial, which includes everything that follows from lacking characteristics, such as lacking characteristics, being free of characteristics, bearing the same characteristic, and bearing a single characteristic up to being devoid of characteristics.

source: མཚན་ཉིད་མེད་པའི་བར་དུའོ། །ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །
en: All phenomena lack a self.

source: ཆོས་ཐམས་ཅད་ནི་བདག་ཏུ་མི་དམིགས་པའོ། །ངར་སེམས་པ་མེད་པའོ། །རྟེན་མེད་པའོ། །
en: All phenomena are not apprehended as a self, lack pride, are baseless, and are inexpressible.

source: བརྗོད་དུ་མེད་པའོ། །ཆོས་ཐམས་ཅད་ནི་ཡི་གེ་མེད་པའོ། །
en: All phenomena are wordless.

source: རིགས་ཀྱི་བུ་འདུ་བྱེད་ཐམས་ཅད་ནི་སྐད་ཅིག་མ་ཟད་པ་དང་བྲལ་བའོ་ཞེས་ཉོན་མོངས་པ་དང་འཁྲུག་པ་མེད་པར་བྱ་བའི་ཕྱིར་བདག་དང་གཞན་ལ་གནོད་པ་མེད་པ་སྤྲོས་པ་མེད་པའི་བཟོད་པ་བསྒོམ་པར་བྱའོ། །
en: “Noble son, in order to eliminate afflictions and disturbances, you should think, ‘All compounded phenomena are momentary and free from destruction,’ as you cultivate the acceptance devoid of elaboration that brings no harm to oneself or others.

source: འདི་ལ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེའི་དབང་གི་བཟོད་པ་བསྒོམ་པ་ན་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་ཞེས་བྱ་བ་ཐོབ་བོ། །
en: Noble son, when bodhisattvas cultivate such powerful acceptance, they reach the acceptance that tames beings with the sky-colored method of perfect conduct.

source: བཟོད་པ་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྐད་ཅིག་མ་གཅིག་དང་ཡང་དག་པར་ལྡན་པ་ཙམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལས་ལྷག་པར་ལུས་ཡོངས་སུ་སྤྲུལ་ཏོ། །
en: Instantly and at the same time, the bodhisattvas who have attained this acceptance will emanate bodies in all the buddha realms more numerous than all the tiniest particles of dust.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕྱོགས་བཅུ་སྟོང་པ་དང་། རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སོང་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་རེ་རེར་ཡང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཆར་གཏོང་བ་ནི་འདི་ལྟ་སྟེ། ཟས་ཀྱི་ཆར་རམ། སྐོམ་གྱི་ཆར་རམ།
en: They will travel to those buddha realms throughout the ten directions, as numerous as the tiniest particles of dust, that are empty of buddhas and those inundated with the five impurities.

source: གོས་སམ། ལྷབ་ལྷུབ་བ་བམ། དྲིའམ། མེ་ཏོག་གམ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་ཡང་རབ་ཏུ་འོང་ངོ་། །གང་སེམས་ཅན་ཟས་དང་།
en: They will rain down various things in each of those buddha realms such as a rain of food, drinks, clothes, ornaments, perfumes, flowers, and different precious gems as numerous as all those tiniest particles of dust.

source: སྐོམ་དེ་ཡོངས་སུ་ཟོས་པས་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་། བདེ་བ་འཐོབ་པའི་སེམས་ཅན་དེ་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པ། སྡུག་བསྔལ་བ། བདག་མེད་པ། སྟོང་པ་ཉིད་ཀྱི་དྲན་པ་དང་།
en: The beings who ingest those foods and drinks will achieve joy and happiness that is free from sensual desire; remember that all compounded phenomena are impermanent, are suffering, lack a self, and are empty; and they will develop discipline.

source: ཚུལ་ཁྲིམས་ཐོབ་བོ། ཁྱིམ་གྱི་བཅིངས་པ་ཐམས་ཅད་དང་། འདོད་པའི་ཡོན་ཏན་ལྔ་སྤངས་ཏེ་བྱུང་ནས་རིའི་སུལ་དང་། ཁྱིམ་མེད་པ་སྟོང་པའི་ནགས་ཚལ་སྟུག་པོར་གནས་པར་འགྱུར་རོ། །
en: They will then renounce the five sense pleasures and all of the trappings of home, leave, and go live without a home in mountain caves and dense, deserted forests.

source: དྲང་སྲོང་གི་ཆ་བྱད་ཀྱི་རྩྭ་དང་། རྩ་བ་དང་འབྲས་བུའི་ཟས་ལ་གནས་པར་འགྱུར་རོ། །
en: Wearing the clothes of seers, they will sustain themselves on grasses, roots, and fruits.

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དེ་དག་ལ་མི་བཟད་པར་མོས་ཤིང་། བརྩོན་འགྲུས་རྩོམ་པ་ལ་སྤྲོ་བར་བྱེད་དོ། །ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་དག་ལ་ནད་དང་། ཤུ་བ་དང་།
en: They will develop a sense of horror toward the five aggregates that are the basis of grasping, and enthusiasm for undertaking their task with diligence.

source: ཟུག་རྔུ་དང་། མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་ཡིད་ལ་བྱེད་དོ། །
en: They will regard those five aggregates that are the basis of grasping as being like a disease, an abscess, or a splinter, and as impermanent, suffering, empty, and lacking a self.

source: མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་བོ། །ཚངས་པ་དང་།
en: They will attain the five supernormal faculties.

source: འཇིག་རྟེན་ལ་གཞོལ་བར་འགྱུར་རོ། །
en: They will become inclined toward the world of the Brahmā gods.

source: དེ་བཞིན་དུ་གོས་ནས་རིན་པོ་ཆེ་ཡོངས་སུ་སྦྱང་བའི་བར་དུ་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ། །དེ་ཤེས་པས་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་། བདེ་བ་ཐོབ་པ་ནས་ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་བར་དུ་གཞོལ་བར་འགྱུར་རོ། །
en: They will partake of the other rainfalls as well, from clothes to pure gems, and by perceiving them they will attain everything from joy and happiness that is free from sensual desire up to becoming inclined toward the world of the Brahmā gods.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་དེ་བཞིན་དུ་གང་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་འདི་དག་ཐོབ་པ་དེ་སྙིམ་པས་མེ་ཏོག་ནམ་མཁའ་ལ་གཏོར་བའི་མེ་ཏོག་དེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སྟོང་པ་དང་།
en: “These bodhisattvas who have attained the acceptance that tames beings with the sky-colored method of perfect conduct will hold flowers with their cupped hands, flowers will be scattered across the sky, and flowers will instantly appear in buddha realms throughout the ten directions that are as numerous as the tiniest particles of dust, no matter if they are empty of buddhas or inundated with the five impurities.

source: རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐད་ཅིག་མ་གཅིག་གིས་སོང་བའི་མེ་ཏོག་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཆོས་ཀྱི་སྒོ་བརྗོད་པའི་དབྱངས་འབྱུང་བ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་དབྱངས་མེད་པའོ། །བདུད་བཞིའི་ཡུལ་ལས་འདའ་བའོ། །
en: And in each one the melodies of as many gateways to the Dharma as there are minute particles of dust in a buddha realm will resound with the following song: ‘All phenomena lack melody and transcend the domain of the four māras.

source: ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་ལམ་མོ། །གནས་ཡང་དག་པར་སྤོང་བའོ། །ཡི་གེ་མེད་པའོ། །
en: All phenomena are like a path in the sky, utterly baseless, and wordless.

source: ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་ཡང་དག་པར་གཞོལ་བའོ། །མི་སྐྱེ་བའོ། །
en: All phenomena associated with attachment do not arise.

source: ཆོས་ཐམས་ཅད་ནི་ཉོན་མོངས་པ་ཡང་དག་པར་གཞོལ་བའོ། །མ་འགགས་པའོ། །
en: All phenomena associated with the afflictions do not cease.

source: ཆོས་ཐམས་ཅད་ནི་སྔོན་གྱི་དམ་ཚིག་མི་གཏོང་བའོ། །མཚན་ཉིད་མེད་པའོ། །
en: All phenomena that were not given up in the past lack characteristics.

source: ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་ཡང་དག་པར་གཏོང་བའོ། །རྐྱེན་མེད་པའོ། །
en: All phenomena devoid of attachment lack conditions.

source: ཆོས་ཐམས་ཅད་ནི་ཀུན་ཏུ་སྦྱོར་བ་ཡང་དག་པར་གཏོང་བའོ། །གནས་མེད་པའོ། །
en: All phenomena that are devoid of fetters are baseless.

source: ཆོས་ཐམས་ཅད་ནི་རྩོམ་པ་མེད་པའོ། །
en: All phenomena are effortless.

source: ཆོས་ཐམས་ཅད་ནི་བདག་གིར་བྱ་བ་དང་། ང་ཡིར་བྱ་བ་ཡང་དག་པར་གཏོང་བའོ། །
en: All phenomena are without ownership and possession.

source: ཆོས་ཐམས་ཅད་ནི་དབེན་པའོ། །འདུ་འཛི་ཡང་དག་པར་གཏོང་བའོ། །
en: All phenomena are without isolation or contact.

source: བདག་མེད་པའོ། །
en: All phenomena lack a self.

source: ཆོས་ཐམས་ཅད་ནི་བདག་དང་བྲལ་བ་ནས་བརྗོད་དུ་མེད་པའི་བར་དུའོ། །རབ་ཏུ་ཞི་བའོ། །མི་སྣང་བ་ཐོབ་པའོ། །
en: All phenomena are everything from being free from a self up to being inexpressible.

source: མི་གནས་པའོ། །ཤིན་ཏུ་ཡུལ་མེད་པའོ། །ཤིན་ཏུ་རྩ་བ་མེད་པའོ། །ཤིན་ཏུ་རང་བཞིན་མེད་པའོ། །
en: They are quiescent, unmanifest, groundless, objectless, completely rootless, and utterly devoid of intrinsic nature.

source: གཉེན་པོ་མེད་པའོ། ཁ་ཟས་མེད་པའོ། །ཤིན་ཏུ་འཐོར་བ་མེད་པའོ། །འཇུངས་པ་མེད་པའོ། །ཤིན་ཏུ་བསམ་གཏན་བྱེད་པའོ། །
en: They are without antidote, without nourishment, without dispersion, and without avarice.

source: ཤིན་ཏུ་བསྒྲིབས་པ་མེད་པའོ། །ཤིན་ཏུ་འོང་བ་མེད་པའོ། །ཉམ་ཆུང་བའོ། །དངོས་པོ་མེད་པའོ། །
en: They bring about concentration and are utterly devoid of hindrance.

source: བྱེད་པ་མེད་པའོ། །ཚོར་བ་མེད་པའོ། །ཟག་པ་མེད་པའོ། །འཛིན་པ་མེད་པའོ། །རྣམ་པར་ཤེས་པ་མེད་པའོ། །
en: They are without coming, weak, insubstantial, devoid of agent, without feeling, without the passions, without clinging, and without consciousness.

source: སྨིག་རྒྱུ་ལྟ་བུའོ། །བྲག་ཅ་ལྟ་བུའོ། །མིག་ཡོར་ལྟ་བུའོ། །ཆུ་ཟླ་ལྟ་བུའོ། །
en: They are like a mirage, an echo, an optical distortion, the reflection of the moon in water, and a reflection in a mirror.

source: གཟུགས་བརྙན་ལྟ་བུའོ། །ནམ་མཁའ་དང་མཉམ་པའོ། །དངོས་པོ་མེད་པའོ། །
en: They are like space and insubstantial.

source: མཚན་ཉིད་མེད་པ་ནས་མཚན་ཉིད་མེད་པ་དང་། མཚན་ཉིད་དང་བྲལ་བ་དང་། མཉམ་པའི་མཚན་ཉིད་དང་། མཚན་ཉིད་གཅིག་པ་དང་། མཚན་ཉིད་མེད་པའི་བར་དུའོ། །
en: They are everything that follows from lacking characteristics, such as lacking characteristics, being free from characteristics, bearing the same characteristic, and bearing a single characteristic, up to being devoid of characteristics.

source: ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པའོ། །ངར་སེམས་པ་མེད་པའོ། །གཟུང་དུ་མེད་པའོ། །བརྗོད་དུ་མེད་པའོ། །
en: All phenomena lack a self, lack pride, lack apprehension, and are inexpressible.

source: ཆོས་ཐམས་ཅད་ནི་སྐད་ཅིག་མའོ། །
en: All phenomena are momentary.’

source: འདུ་བྱེད་ཟད་པ་དང་བྲལ་བའོ་ཞེས་བཟོད་པའི་སེམས་བསྒོམ་པར་བྱའོ། །
en: You should cultivate the thought of accepting the fact that ‘all compounded phenomena are free from destruction.’

source: ཆོས་ཐམས་ཅད་ནི་སྐད་ཅིག་མ་ཞེས་ཞི་བའི་སེམས་བསྒོམ་པར་བྱའོ། །མཉམ་པའི་སེམས་དང་། རྣམ་པར་ཞི་བའི་སེམས་དང་། འཛིན་པ་མེད་པའི་སེམས་དང་། འབྱུང་བ་མེད་པའི་སེམས་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་དང་།
en: You should cultivate the thought of peace that ‘all phenomena are momentary.’

source: ཆོད་པ་མེད་པའི་སེམས་དང་། ཕྱིན་ཅི་མ་ལོག་པའི་སེམས་དང་། རྟེན་མེད་པའི་སེམས་དང་། མཉམ་པར་བཞག་པའི་སེམས་དང་། སྡུག་བསྔལ་གྱི་སེམས་བསྒོམ་པར་བྱའོ། །
en: You should cultivate the thought of equanimity, the thought of utter peace, the thought that is devoid of clinging, the thought of nonorigination, the thought of the lack of hindrances, the thought that is uninterrupted, the thought that is not contradictory, the thought of the lack of support, the thought of equipoise, and the thought of suffering.

source: དེ་བཞིན་དུ་ཉེ་བར་ཞི་བ་སྟོང་པ་ཕྱི་དང་ནང་གི་འཇིག་པ་བརྗོད་པའི་ཆོས་ཀྱི་སྒོ་དང་། ཚད་མེད་གྲངས་མེད་པའི་ཆོས་ཀྱི་སྒོ་མེ་ཏོག་དེ་དག་ལ་འབྱུང་བར་འགྱུར་རོ། །
en: The gateways to the Dharma that express tranquility, emptiness, and internal and external disintegration, as well as countless other gateways to the Dharma, will resound in those flowers.

source: སེམས་ཅན་དེ་ཡང་ཆོས་ཀྱི་སྒོ་དེ་ཐོས་ནས་ཟང་ཟིང་མེད་པའི་དགའ་བ་དང་། བདེ་བ་ཐོབ་པ་དེ་འདུ་བྱེད་ཐམས་ཅད་ནི་མི་རྟག་པ། སྡུག་བསྔལ་བ། བདག་མེད་པ། སྟོང་པ་ཉིད་ཀྱི་དྲན་པ་དང་།
en: “When they hear those gateways to the Dharma, beings will attain joy and happiness that is free from sensual desires; they will remember that all compounded phenomena are impermanent, are suffering, lack a self, and are empty; and they will develop discipline.

source: ཚུལ་ཁྲིམས་ཐོབ་བོ། །ཁྱིམ་གྱི་བཅིངས་པ་ཐམས་ཅད་དང་། འདོད་པའི་ཡོན་ཏན་ལྔ་ཡང་དག་པར་སྤངས་ཏེ་བྱུང་ནས་རིའི་སུལ་དང་། ཁྱིམ་མེད་པ་སྟོང་པའི་ནགས་ཚལ་སྟུག་པོར་གནས་པར་འགྱུར་རོ། །
en: They will then renounce all the fetters related to households and the five sense pleasures, and they will go live far from their homes, in mountain caves and thick, deserted forests.

source: དྲང་སྲོང་གི་ཆ་བྱད་ཀྱིས་འབྲས་བུ་དང་། རྩ་བ་དང་། རྩྭའི་ཟས་ལ་གནས་པར་འགྱུར་རོ། །
en: They will dress like seers and survive by feeding on grass, roots, and fruits.

source: ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དེ་དག་ལ་མི་བཟད་པར་མོས་ཤིང་བརྩོན་འགྲུས་རྩོམ་པ་ལ་སྤྲོ་བར་བྱེད་དོ། །ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་དག་ལ་ནད་དང་། ཤུ་བ་དང་།
en: Thinking that the five aggregates that are the basis of grasping are terrifying, they will enthusiastically develop their diligence.

source: མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་བོ། །ཚངས་པའི་འཇིག་རྟེན་ལ་གཞོལ་བར་འགྱུར་རོ། །
en: They will develop the five supernormal faculties, and they will become inclined toward the world of the Brahmā gods.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་འདྲ་བའི་བཟོད་པ་སྒོམ་པ་དེ་ནི་མིང་མི་དམིགས་སེམས་ཅན་མི་དམིགས། སྲོག་མི་དམིགས། གསོ་བ་མི་དམིགས། གང་ཟག་མི་དམིགས། གཟུགས་མི་དམིགས།
en: “Noble son, the bodhisattvas who cultivate this acceptance do not apprehend a name, a being, a life force, a soul, a person, or form.

source: ཚོར་བ་མ་ཡིན། འདུ་ཤེས་མ་ཡིན། འདུ་བྱེད་མ་ཡིན། རྣམ་པར་ཤེས་པའང་མི་དམིགས།
en: There is no feeling, perception, or formation, and they do not apprehend consciousness.

source: མིག་མི་དམིགས། རྣ་བའང་མ་ཡིན། སྣའང་མ་ཡིན། ལྕེའང་མ་ཡིན། ལུས་ཀྱང་མི་དམིགས། ཡིད་ཀྱང་མི་དམིགས་སོ། །
en: They do not apprehend the eyes, ears, nose, or tongue, they do not apprehend a body, and they do not apprehend a mind.

source: གཟུགས་མི་དམིགས། སྒྲ་མི་དམིགས། དྲི་མི་དམིགས། རོ་མི་དམིགས། རེག་མི་དམིགས། ཆོས་མི་དམིགས། ཡིད་མི་དམིགས། ལུས་མི་དམིགས། ཚིག་མི་དམིགས། སེམས་མི་དམིགས་སོ། །སྟོང་པ་ཉིད་མི་སོགས་པ། མཚན་མ་མེད་པ། ཐུབ་པ།
en: They do not apprehend form, sound, smell, taste, touch, mental phenomena, the mental faculty, body, names, or the mind.

source: ཁམས་གསུམ་གཏོང་བ་མེད་པ། མངོན་པར་འདུ་མི་བྱེད་པ། མ་སྐྱེས་པ། མ་བསྒོམས་པ། མ་བྱང་བའི་བཟོད་པ་འདི་སྨྲས་སོ། །
en: They proclaim the acceptance of the nonaccumulation of emptiness, the absence of marks, the ability to withstand suffering, not abandoning the three realms, not being affected, the unborn, the absence of cultivation, and the absence of training.

source: མ་བྱས་པ། བྱ་བ་མེད་པ་དེ་སྔོན་གྱི་མཐའ་ལ་བྱ་བ་མེད་པ། ཕྱི་མའི་མཐའ་ལ་འདས་པ་མེད་པ། དབུས་ཀྱི་མཐའ་ལ་ཡང་དག་པར་མེད་པ། མི་གནས་པ།
en: Nothing has been created and nothing will be created, which means that there is no activity in the past, the past is not present in the future, there is absolutely nothing in the middle of these, there is no basis, and there is no observation.

source: མི་དམིགས་པ། ཡིད་ལ་མི་བྱེད་པའི་བཟོད་པ་འདི་བསྒོམ་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དག་པར་སྤྱོད་པའི་ཚུལ་ནམ་མཁའི་མདོག་གིས་འདུལ་བ་ཞེས་བྱ་བའི་བཟོད་པ་ཐོབ་བོ། །
en: When they cultivate this acceptance of mental nonengagement, bodhisattva great beings attain the acceptance that tames beings with the sky-colored method of perfect conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་འདི་ཐོབ་པས་ཇི་ལྟ་བུར་གོང་དུ་བཤད་པའི་རྩལ་འདི་འདྲ་བ་བྱ་བར་འགྱུར་རོ། །
en: And by attaining this acceptance, they will activate the powers that were described above.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་འདི་བསྟན་པ་སྟོན་ཅིང་བརྗོད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་མི་རྟོག་པ་ཞེས་བྱ་བས་ལེགས་སོ་ཞེས་བྱ་བ་བྱས་ཏེ།
en: When the bodhisattva Destroyer of Aggregates had delivered and proclaimed this teaching, the bodhisattva Absence of Concepts voiced his approval.

source: བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དག་ཅང་མི་སྨྲ་བར་གྱུར་ནས། བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་ཞལ་གྱིས་བཞེས་པར་གྱུར་པ་དང་།
en: The crowd of bodhisattvas remained silent, and the Blessed One gave his approval by not saying a word.

source: དེ་ནས་དགེ་སློང་དྲུག་ཅུ་ཙམ་འདི་སྙམ་དུ་སེམས་ཏེ། རིགས་ཀྱི་བུ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་ཅི་ལ་བསམས་ཏེ་རྣམ་པ་འདི་ལྟ་བུའི་སྒྱུ་མ་འདྲ་བའི་འདུ་བྱེད་ཐམས་ཅད་སྟོན། གལ་ཏེ་གཟུགས་བདག་མེད་པ། མི་སྣང་བ། ཀུན་ནས་ལྡང་བ་མེད་པ། ཡིད་ལ་མི་བྱེད་པ། མི་རྟོག་པ། རྣམ་པར་མི་རྟོག་པ། དམིགས་པ་མེད་པ། རྒྱུ་བ་མེད་པའམ། འོན་ཏེ་འདི་ལྟ་ཅི།
en: Sixty monks then thought, “What was the noble son Destroyer of Aggregates thinking when he taught that all compounded phenomena are similar to those types of illusions?

source: སེམས་ཅན་ནམ། སྲོག་གམ། སྐྱེ་བའམ། གསོ་བའམ། གང་ཟག་གམ། ཤེད་ལས་སྐྱེས་པའམ། ཤེད་ཅན་ནམ། བྱེད་པ་པོའམ། ཚོར་བ་པོའམ། ཚོར་བ་གཞན་ནམ། སྐྱེ་བའམ། ཡང་དག་པར་སྐྱེ་བའམ། གང་མི་དགའ་བ་དང་།
en: If form lacks a self, if there is no appearance, if nothing arises at all, if it is not engaged mentally, if it is without concept and nonconceptual, if there is no basis of observation and no material evolution, wouldn’t it be the case that there would be no being, life force, birth, soul, person, humans, living creatures, agent, individual who feels, others who feel, arising, production, dislike, or lack of nonorigination?

source: མི་འབྱུང་བ་མེད་པར་མི་འགྱུར་བའམ། དེ་བཞིན་གཤེགས་པ་ནི་གང་དུ་བྱུང་།
en: On what basis would the thus-gone ones appear?

source: སྙིང་རྗེ་ཆེན་པོ་ནི་གང་ན།
en: Where would their compassion manifest?

source: ཆོས་འཆད་པ་ནི་སུ་ཞིག །
en: Who would explain the Dharma?

source: ཆོས་ཀུན་ཤེས་པ་ནི་གང་ཞིག །
en: Who would know all phenomena?

source: བསླབ་པ་སྡོམ་པ་ནི་གང་ན་གནས།
en: Who would maintain the precepts and vows?

source: གལ་ཏེ་ཕུང་པོར་མི་འགྱུར་ན་དེ་ལྟར་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ཀྱང་དགེ་བ་རྣམས་ཀྱི་ཆོས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པར་མི་འགྱུར་ན། ལེགས་པར་བྱས་པ་དང་། ཉེས་པར་བྱས་པའི་ལས་ཀྱི་འབྲས་བུ་ནི་གང་དུ་སྨིན།
en: If there are no aggregates and if the results of virtuous qualities do not ripen on the basis of the elements and the sense fields, where do the results of wholesome and unwholesome deeds ripen?

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་གང་དུ་འབྱུང་།
en: To whom do the thus-gone ones, the worthy, perfect buddhas, appear?

source: ཉན་ཐོས་དང་། རང་རྒྱལ་བ་རྣམས་དང་། ལྷ་དང་མི་རྣམས་དང་། གང་གཞན་ཡང་སེམས་ཅན་གྱི་ལུས་སྐྱེ་མཆེད་དྲུག་གིས་བཟུང་བ་ནི་གང་དུ་བྱུང་།
en: To whom do the objects apprehended by the sense fields such as the bodies of hearers, solitary buddhas, gods and humans, and any other beings appear?

source: བདག་ནི་སྟན་ལས་ལངས་ཏེ་འགྲོ་བར་བྱ་སྙམ་མོ། །
en: We should stand up and leave this place!”

source: དེ་ནས་དགེ་སློང་དྲུག་ཅུ་ཙམ་སྟན་ལས་ལངས་ཏེ་དོང་ནས་དགེ་སློང་གཞན་དག་ཀྱང་ཅང་མི་སྨྲ་བར་གྱུར་པ་དང་།
en: And so those sixty monks stood up and left while the other monks remained silent.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་བཅོམ་ལྡན་འདས་ལ་ངོ་ཚ་ཞིང་མི་སྤོབས་པ་དང་གནོང་བར་གྱུར་ཏོ། །
en: The bodhisattva Destroyer of Aggregates felt embarrassed, timid, and ashamed before the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་མར་མེ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་པ་དེས། བྱང་ཆུབ་སེམས་དཔའ་ཕུང་པོ་རྣམ་པར་འཇིག་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དོན་གྱི་དབང་གང་མཐོང་ན་འཁོར་སྨྲ་བ་དང་བཅས་པ་ལ་ཆོས་ཀྱི་ཚུལ་རྣམ་པ་འདི་ལྟ་བུ་ཟབ་མོ་ཡང་དག་པར་སྟོན།
en: Then the bodhisattva Lamp in the Hands, who was present in the assembly, inquired of the bodhisattva Destroyer of Aggregates, “Why did you teach such a profound Dharma to this talkative assembly?
